13/data/attachments/a4f650839d31408b.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_b5d7f9db-59ba-4d4d-950e-6cab5b1206f6</nif:username>
            <nif:friendToBeAdded>James_contain_Friend_30031_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>